---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.BadFaceFoundInDwg
source: html/26ecad6f-f1c9-82a0-a93f-07893ca4618c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.BadFaceFoundInDwg Property

One or more hatch regions were found in the imported file with unconnected boundaries. These hatch regions will be ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadFaceFoundInDwg { get; }
```